# ViewId Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
Viewport..::..ViewId Property
Viewport Class See Also
---
The element id of the associated View.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId ViewId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ViewId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ ViewId {
	ElementId^ get ();
}
```

# See Also
Viewport Class
Autodesk.Revit.DB Namespace